Primeiro desafio - ETL e Manipulação de dados

In [10]:
# importar bibliotecas
import pandas as pd
import sqlite3

In [4]:
# Leitura do Arquivo
data_path = "sales_data.csv"
df = pd.read_csv(data_path)
# df.head()

240

In [6]:
# Remover linhas duplicadas e tratar valores faltantes
df.drop_duplicates()
df.fillna(0)
# df.head()

240

In [9]:
# Converter FICT para USD
cambio = 0.75
df["sale_value_usd"] = df["sale_value"]*cambio
#df.head()

,transaction_id,date,product_id,seller_id,sale_value,currency,sale_value_usd
0,1001,2023-07-25,501,2001,150,FICT,112.50
1,1002,2023-07-25,502,2001,300,FICT,225.00
2,1003,2023-07-25,501,2002,160,FICT,120.00
3,1004,2023-07-25,503,2002,210,FICT,157.50
4,1005,2023-07-25,504,2003,75,FICT,56.25

In [12]:
# conectar a um banco de dados relacional
# em seguida, enviar os dados para o banco
# caso a tabela já exista, adicionar os dados a ela.
# ao final, encerrar conexão
con = sqlite3.connect("sql_db")
df.to_sql("sales_data", con, if_exists="append", index="false")
con.close()